база клиента/Reports/ПродажиСостатками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПродажиСостатками</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлажокНастройкиСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравненияСклад</Name>
					<Type>
						<v8:Type>ent:ComparisonType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлажокНастройкиНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравненияНоменклатура</Name>
					<Type>
						<v8:Type>ent:ComparisonType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

база клиента/Reports/ПродажиСостатками/Ext/ObjectModule.bsl
Функция ПустоеЗначениеТипа(ЗаданныйТип)
	
	Если ЗаданныйТип = Тип("Число") Тогда
		Возврат 0;
	ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
		Возврат "";
	ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
		Возврат '00010101000000';
	ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
		Возврат Ложь;
	Иначе
		Возврат Новый (ЗаданныйТип);
	КонецЕсли;
	
КонецФункции // ПустоеЗначениеТипа();

Функция ВидСравненияСтр(ТипВидСравнения)
//	
Если ТипВидСравнения =  ВидСравнения.Равно Тогда
			ВидСравненияСтрокой  =  " = " 
ИначеЕсли ТипВидСравнения  =  ВидСравнения.НеРавно Тогда
			ВидСравненияСтрокой  =  "<>"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.ВСписке Тогда
			ВидСравненияСтрокой  =  "В"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.НеВСписке Тогда
			ВидСравненияСтрокой  =  "НЕ В"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.ВСпискеПоИерархии ИЛИ 
			ТипВидСравнения   =  ВидСравнения.ВИерархии Тогда
			ВидСравненияСтрокой  =  "В ИЕРАРХИИ"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.НеВСпискеПоИерархии ИЛИ 
			ТипВидСравнения   =  ВидСравнения.НеВИерархии Тогда
			ВидСравненияСтрокой  =  "НЕ В ИЕРАРХИИ"
КонецЕсли; 
//
Возврат ВидСравненияСтрокой;
//
КонецФункции	

Функция ПолучитьПоследниеДокументыПоступлений(СпТов)
	
зп = новый запрос;
зп.УстановитьПараметр("Номенклатура", СпТов);

зп.Текст = "ВЫБРАТЬ
           |	ПервыеДокументы.Номенклатура КАК Номенклатура,
           |	ПервыеДокументы.Ссылка КАК Док,
           |	СУММА(ПервыеДокументы.Количество) КАК Количество
           |ИЗ
           |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПервыеДокументы
           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
           |			Доки.Номенклатура КАК Номенклатура,
           |			МАКСИМУМ(Доки.Ссылка.Дата) КАК ДатаПервогоДокумента
           |		ИЗ
           |			Документ.ПоступлениеТоваровУслуг.Товары КАК Доки
           |		ГДЕ
           |			Доки.Номенклатура В(&Номенклатура)
           |		
           |		СГРУППИРОВАТЬ ПО
           |			Доки.Номенклатура) КАК ДатыПервыхДокументов
           |		ПО ПервыеДокументы.Номенклатура = ДатыПервыхДокументов.Номенклатура
           |			И ПервыеДокументы.Ссылка.Дата = ДатыПервыхДокументов.ДатаПервогоДокумента
           |ГДЕ
           |	ПервыеДокументы.Номенклатура В(&Номенклатура)
           |
           |СГРУППИРОВАТЬ ПО
           |	ПервыеДокументы.Номенклатура,
           |	ПервыеДокументы.Ссылка
           |АВТОУПОРЯДОЧИВАНИЕ"; 

рез = зп.Выполнить();

Возврат рез.Выгрузить();

КонецФункции	
	
Процедура СформироватьОтчет(тб) Экспорт
	
Макет = ПолучитьМакет("Макет");
обл = макет.ПолучитьОбласть("шапка");

зп = новый запрос;
зп.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
зп.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));

Условие = "";
ПечОтбор = "";

Если ФлажокНастройкиНоменклатура тогда
  зп.УстановитьПараметр("Номенклатура", Номенклатура);
  СтрокаСравнения = ВидСравненияСтр(ВидСравненияНоменклатура);
  Условие = Условие+" И Номенклатура "+СтрокаСравнения+" (&Номенклатура) ";
  ПечОтбор = ПечОтбор + "Номенклатура: " + ВидСравненияНоменклатура + " " + сокрлп(Номенклатура) + "; "
КонецЕсли;	


обл.Параметры.ДатаНач = Формат(ДатаНач, "ДФ=dd.MM.yy");
обл.Параметры.ДатаКон = Формат(ДатаКон, "ДФ=dd.MM.yy");
обл.Параметры.ПечОтбор = ПечОтбор;  

тб.Вывести(обл);

// =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  = 
//"+Условие+"
зп.Текст = "ВЫБРАТЬ
           |	ПродажиОбороты.Номенклатура КАК Номенклатура,
           |	ПродажиОбороты.КоличествоОборот КАК Продано,
           |	ПродажиОбороты.СтоимостьОборот КАК Сумма,
           |	0 КАК ОстатокНач,
           |	0 КАК ОстатокКон
           |ИЗ
           |	РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, , Номенклатура.ЭтоГруппа = ЛОЖЬ "+Условие+" ) КАК ПродажиОбороты
           |ГДЕ
           |	ПродажиОбороты.КоличествоОборот > 0
           |
           |СГРУППИРОВАТЬ ПО
           |	ПродажиОбороты.Номенклатура,
           |	ПродажиОбороты.КоличествоОборот,
           |	ПродажиОбороты.СтоимостьОборот
           |
           |ОБЪЕДИНИТЬ ВСЕ
           |
           |ВЫБРАТЬ
           |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
           |	0,
           |	0,
           |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток,
           |	ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток
           |ИЗ
           |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , Номенклатура.ЭтоГруппа = ЛОЖЬ "+Условие+" ) КАК ТоварыНаСкладахОстаткиИОбороты
           |ИТОГИ
           |	СУММА(Продано),
           |	СУММА(Сумма),
           |	СУММА(ОстатокНач),
           |	СУММА(ОстатокКон)
           |ПО
           |	ОБЩИЕ,
           |	Номенклатура";

рез = зп.Выполнить();

СпТов = рез.Выгрузить().ВыгрузитьКолонку("Номенклатура");

тз_посл_док = ПолучитьПоследниеДокументыПоступлений(СпТов);

ВыборкаНоменклатура = рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
Пока ВыборкаНоменклатура.Следующий() цикл
	
Если ВыборкаНоменклатура.Продано = 0 тогда
  Продолжить;		
КонецЕсли;		
	
обл = макет.ПолучитьОбласть("строка");
обл.Параметры.Заполнить(ВыборкаНоменклатура);
обл.Параметры.Артикул = ВыборкаНоменклатура.Номенклатура.Артикул;  
обл.Параметры.ПечНоменклатура = СокрЛП(ВыборкаНоменклатура.Номенклатура) + ", " + СокрЛП(ВыборкаНоменклатура.Номенклатура.БазоваяЕдиницаИзмерения);

стр_посл_док = тз_посл_док.Найти(ВыборкаНоменклатура.Номенклатура);
Если стр_посл_док <> Неопределено тогда
  обл.Параметры.ДокПрих = стр_посл_док.Док;
  обл.Параметры.Поставщик = стр_посл_док.Док.Контрагент;
КонецЕсли;	

тб.Вывести(обл);
	
КонецЦикла;	

ВыборкаОБЩИЕ = рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОБЩИЕ");
Пока ВыборкаОБЩИЕ.Следующий() цикл
	
обл = макет.ПолучитьОбласть("итог");
обл.Параметры.Заполнить(ВыборкаОБЩИЕ);
тб.Вывести(обл);

КонецЦикла;	
	
// =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  = 
тб.ОтображатьСетку = Ложь;
тб.ТолькоПросмотр = Истина;
//тб.ОтображатьГруппировки = Истина;
тб.ОтображатьЗаголовки = Ложь;
//тб.ФиксацияСлева = 1;
тб.ФиксацияСверху = 5;
	
КонецПроцедуры //СформироватьОтчет(тб)
